# 连接sqlite数据库的不同方法

In [2]:
import sqlite3 as lite
con = lite.connect('test.sqlite')
cur = con.cursor()
cur.execute('SELECT SQLITE_VERSION()')
data = cur.fetchone()
print(data)
cur.close

('3.30.0',)

In [3]:
with lite.connect('test.sqlite') as con:
    cur = con.cursor()
    cur.execute('SELECT SQLITE_VERSION()')
    data = cur.fetchone()
    print(data)

('3.30.0',)

# 使用SQL语句新增，查询数据

In [15]:
#fetchone()是取一个数据， fetchall()取全部的数据放入列表中
import sqlite3 as lite 
with lite.connect("test.sqlite") as con:
    cur = con.cursor()
    cur.execute("DROP TABLE IF EXISTS PhoneAddress") 
    cur.execute("CREATE TABLE PhoneAddress(phone CHAR(10) PRIMARY KEY, address TEXT, name TEXT unique, age INT NOT NULL)") 
    cur.execute("INSERT INTO PhoneAddress VALUES('0912173381','United State','Jhon Doe',53)") 
    cur.execute("INSERT INTO PhoneAddress(phone, address, name, age) VALUES('0928375018','Tokyo Japan','MuMu Cat',6)") 
    cur.execute("INSERT INTO PhoneAddress VALUES('0957209108','Taipei','Richard',29)") 
    cur.execute('SELECT * FROM PhoneAddress')
    data = cur.fetchone()
    print(data[0],data[1])
    print('============================')#使用fetone之后再使用fetchall就回从第二笔数据开始提取
    rows = cur.fetchall()
    for item in rows:
        print(item[0], item[1])

0912173381 United State
============================
0928375018 Tokyo Japan
0957209108 Taipei

# 使用pandas 储存数据

In [16]:
#建立dataframe
import sqlite3 as lite
import pandas as pd 
employee = [{'name':'Mary','age':23,'gender':'F'},{'name':'John','age':33,'gender':'M'}]
df = pd.DataFrame(data = employee)
df

   name  age gender
0  Mary   23      F
1  John   33      M

In [19]:
with lite.connect('test.sqlite') as db:
    df.to_sql(name = 'employee', con = db, if_exists='replace', index = None)